Revit 2027 API
Part.GetSourceElementOriginalCategoryIds Method
 Gets the category ids of the source elements which were used to form this part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetSourceElementOriginalCategoryIds()
Public Function GetSourceElementOriginalCategoryIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetSourceElementOriginalCategoryIds()
member GetSourceElementOriginalCategoryIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The category ids.
See Also
Reference
Part Class
Autodesk.Revit.DB Namespace